-- Automatically generated packer.nvim plugin loader code

if vim.api.nvim_call_function('has', {'nvim-0.5'}) ~= 1 then
  vim.api.nvim_command('echohl WarningMsg | echom "Invalid Neovim version for packer.nvim! | echohl None"')
  return
end

vim.api.nvim_command('packadd packer.nvim')

local no_errors, error_msg = pcall(function()

_G._packer = _G._packer or {}
_G._packer.inside_compile = true

local time
local profile_info
local should_profile = false
if should_profile then
  local hrtime = vim.loop.hrtime
  profile_info = {}
  time = function(chunk, start)
    if start then
      profile_info[chunk] = hrtime()
    else
      profile_info[chunk] = (hrtime() - profile_info[chunk]) / 1e6
    end
  end
else
  time = function(chunk, start) end
end

local function save_profiles(threshold)
  local sorted_times = {}
  for chunk_name, time_taken in pairs(profile_info) do
    sorted_times[#sorted_times + 1] = {chunk_name, time_taken}
  end
  table.sort(sorted_times, function(a, b) return a[2] > b[2] end)
  local results = {}
  for i, elem in ipairs(sorted_times) do
    if not threshold or threshold and elem[2] > threshold then
      results[i] = elem[1] .. ' took ' .. elem[2] .. 'ms'
    end
  end
  if threshold then
    table.insert(results, '(Only showing plugins that took longer than ' .. threshold .. ' ms ' .. 'to load)')
  end

  _G._packer.profile_output = results
end

time([[Luarocks path setup]], true)
local package_path_str = "/home/devin/.cache/nvim/packer_hererocks/2.1.1703358377/share/lua/5.1/?.lua;/home/devin/.cache/nvim/packer_hererocks/2.1.1703358377/share/lua/5.1/?/init.lua;/home/devin/.cache/nvim/packer_hererocks/2.1.1703358377/lib/luarocks/rocks-5.1/?.lua;/home/devin/.cache/nvim/packer_hererocks/2.1.1703358377/lib/luarocks/rocks-5.1/?/init.lua"
local install_cpath_pattern = "/home/devin/.cache/nvim/packer_hererocks/2.1.1703358377/lib/lua/5.1/?.so"
if not string.find(package.path, package_path_str, 1, true) then
  package.path = package.path .. ';' .. package_path_str
end

if not string.find(package.cpath, install_cpath_pattern, 1, true) then
  package.cpath = package.cpath .. ';' .. install_cpath_pattern
end

time([[Luarocks path setup]], false)
time([[try_loadstring definition]], true)
local function try_loadstring(s, component, name)
  local success, result = pcall(loadstring(s), name, _G.packer_plugins[name])
  if not success then
    vim.schedule(function()
      vim.api.nvim_notify('packer.nvim: Error running ' .. component .. ' for ' .. name .. ': ' .. result, vim.log.levels.ERROR, {})
    end)
  end
  return result
end

time([[try_loadstring definition]], false)
time([[Defining packer_plugins]], true)
_G.packer_plugins = {
  LuaSnip = {
    loaded = true,
    path = "/home/devin/.local/share/nvim/site/pack/packer/start/LuaSnip",
    url = "https://github.com/L3MON4D3/LuaSnip"
  },
  ["alpha-nvim"] = {
    config = { "\27LJ\2\n�_\0\0\r\0)\1R6\0\0\0'\2\1\0B\0\2\0026\1\0\0'\3\2\0B\1\2\0026\2\0\0'\4\3\0B\2\2\0026\3\0\0'\5\4\0B\3\2\0029\3\5\3B\3\1\0025\4\6\0009\5\a\0019\5\b\5=\4\t\0059\5\a\0019\5\b\0059\5\n\5'\6\f\0=\6\v\0056\5\r\0009\5\14\0059\5\15\5)\a\0\0'\b\f\0005\t\17\0009\n\16\3=\n\18\tB\5\4\0015\5\19\0009\6\a\0019\6\20\0064\a\6\0009\b\21\1'\n\22\0009\v\23\5'\f\24\0&\v\f\v'\f\25\0B\b\4\2>\b\1\a9\b\21\1'\n\26\0009\v\27\5'\f\28\0&\v\f\vB\b\3\2>\b\2\a9\b\21\1'\n\29\0009\v\30\5'\f\31\0&\v\f\vB\b\3\2>\b\3\a9\b\21\1'\n \0009\v!\5'\f\"\0&\v\f\vB\b\3\2>\b\4\a9\b\21\1'\n#\0009\v$\5'\f%\0&\v\f\v'\f&\0B\b\4\0?\b\0\0=\a\t\0069\6\5\0009\b\n\1B\6\2\0016\6\r\0009\6'\6'\b(\0B\6\2\1K\0\1\0003 autocmd FileType alpha setlocal nofoldenable \bcmd\f:qa<CR>\f [Quit]\texit\6q\17 [Bookmarks]\rbookmark\n<C-e>\17 [Find File]\15filesearch\15<leader>pf\17 [File Tree]\tfile\14<leader>t\14:enew<CR>\16 [New File]\bnew\6e\vbutton\fbuttons\1\0\5\rbookmark\b\bnew\b\15filesearch\b\tfile\b\texit\t󰅗\afg\1\0\1\tbold\2\14waveAqua1\16nvim_set_hl\bapi\bvim\20DashboardHeader\ahi\topts\bval\vheader\fsection\0018\0\0�\1                                     ██████▓▓▓▓▓▓▓▓▓▓▓▓▓▓██████                                     �\1                          ███▓▓▓▓▓▓▓▓▓▓▓▓██████████████████▓▓▓▓▓▓▓▓▓▓▓▓███                          �\1                   ██▓▓▓▓▓▓▓▓████████████▒███▒▒██▒██▒▒▒▒█▒▒████████████▓▓▓▓▓▓▓██                    �\1                 █▓▓▓▓██████▒▒▒█▒▒▒▒▒█▒▒▒▓███▒▒██▒█▒███▒▒▒▓██▒█▒▒██▒█▒▒███████▓▓▓▓█                 �\1                 █▓▓███████▒███▓▒███▒▒█▒▒████▒▒██▒█▒███▒▒▒▓██▒█▒█▒█▒█▒███▒███████▓█                 �\1                 █▓▓███████▒▒███▒███▒█▒▒█▒███▒▒██▒█▒▒▒▒▒█▒▒██▒█▒██▒▒█▒███▒▒██████▓█                 �\1                 █▓▓███████▒█████▒▒▒███████████████████████████████▒█▒▒██▒██▒▒█▒█▓█                 �\1                 █▓▓███████████████▓▒▒▒▒▒████████████████████████████████████▒█▒█▓█                 �\1                 █▓▓███████▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒████████████████████████████████▒▒▒▒█▓█                 �\1                 █▓▓█▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒██▒█▒▒▒▒███████████████████████████▒██▒█▓█                 �\1                 █▓▓█▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒██████████████████▓████▓██▒█▓█                 �\1                 █▓▓█▒▒██▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒██████████▒▒▒▒▒████▓██████▓█                 �\1                 █▓▓█▒▒████████▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒█████▒▒▒▒▒██████████▒▒██▓█                 �\1                 █▓▓█▒▒▒███████████▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒██▒▒▒█████████████████▓█                 �\1                 █▓▓█▒▒▓  ███████████▒▒▒▒▒▒▒▒▒▒▒██▒▒███▒▒▒█▒▒▒███████████████████▓█                 �\1                 █▓▓█▒▒▒█    █████████▒▒▒▒▒▒█▒▒▒▒▒▒▒▒▒▒▒▓█▒▒░███████████ ████▒█▒█▓█                 �\1                 █▓▓█▒▒▒▒█   ░██████████▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒███████████  ██████▒█▓█                 �\1                 █▓▓█▒▒▒▒▓    █ █░ ███ █▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒░██████ █     ███▒▒▒▒▓▓█                 �\1                 █▓▓█▒▒▒▒▒▒█    █   ░█▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒█████     ██████▒█▓▓█                 �\1                 █▓▓█▒▒▒▒▒▒▒█░░   █▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒█▒ ░   ████████▒▓▓█                 �\1                 █▓▓█▒▒▒▒▒▒▒▒█░▓██▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒███████▒█▒▓▓█                 �\1                 █▓▓█▒▒▒▒▒▒▒▒▒██▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒██████████▓▓                  �\1                 █▓▓█▒▒▒▒▒▒▒▒▒▓█▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒█▒▒▒▒▒▒▒▒▒▒▒▒█▒▒▒████▒███▒▓▓                  �\1                 █▓▓█▒▒▒▒█▒▒▒▒█   █▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒█████▒▓███▓▓                  �\1                 █▓▓█▒▒▒▒▒▒▒▒▒▒█   ▒▒▒▒▒▒▒▒▒▒█▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▓▒▒▒▒█ ███▒▒▒▒█▓▓                  �\1                 █▓▓█▒▒▒▒▒▒▒▒▒▒█   ▓▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒█▒▒▒▒▒▒▒▒█▒▒▒▒▒█  ▓███▒███▓▓▓                  �\1                  ▓▓█ █▒▒▒▒█▒▒░█   ▒█████████▒▒██▒▒▒█▒▒▒▒▒█████▒▒▒▒▒   █████▒▒▒█▓▓                  �\1                  ▓▓█  ░██▒█▒▒▒ ██▒▒▒████   ████▒▒▒▒▒▒███ █ ███▒▒▒▒▒▓ ░█████▒▒▒█▓▓                  �\1                  ▓▓█      █▒▒▒  ░█▒▒▒▒██████████▒▒▒▒████████▒▒▒████  ███████▒██▓▓                  �\1                  ▓▓▓█  ░████▒▒▒█  ██▒▒▒▒▒▒▒▒█▒█▒▒▒▒▒█▓▒▒▒▒▒▒▒▒▒▒▒█  ███████████▓█                  �\1                  █▓▓██░██████▒▒▒▒░░ ██▒▒▒▒▒▒▒▒█▒▒▒▒▒█▒▒▒▒▒▒▒▒█    ████████████▓▓                   �\1                   █▓▓████████▒▒▒▒█░     ▓▒▒▒▒▒▒▒▒▒▒▒█▒▒▒▒█   ░     ██████████▓▓█                   �\1                    ▓▓▓████████▒▒▒▒▒▒▒█    ▒▒▒▒▒▒▒▒▒▒▒▒▒░     ▒█ ████████████▓▓█                    �\1                    █▓▓▓██████████▒▒▒▒▒▒▒████▒▒▒▒▒▒▒▒▒█   ░█████████████████▓▓█                     �\1████████████▓▓▓▓▓▓▓▓▓▓▓▓▓███████████▒▒▒▒▒▒▓▓  ▒▒▒▒▒▒▒▒   ██████████████████▓▓█                      �\1█▓██████████████████████████████████████▓▓▓▓   █▒▒▒▒▒    █████████████████▓▓█                       �\1 █▓▓█░   █░                             ▓▓▓▓   █▒▒▒▒▒█   ▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓█▓█                        �\1   ▓▓▓██▒  ░          ░    ░ ░          ▓▓▓▓  ▒███████░  ▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓█▓█                        �\1     █▓▓▓▓██████████████████████████████▓▓▓▓▓  ███████  ██████████████████▓█                        �\1         ███▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓████████▒▒▒▓▓░█░   █    ██████████████▓▓▓▓▓█                         �\1                              ▓▓▓███████▒▒▓▓▒▒▒▒▒▓█████████████████▓▓█                              �\1                               █▓▓▓███████▒▒▒▒▒▒▒▒███████████████▓▓▓                                �\1                                 █▓▓▓█████▓▒▒▒▒▒▒▒▒████████████▓▓▓█                                 �\1                                   █▓▓▓███▓▒▒▒▒▒▒▒▒██████████▓▓▓█                                   �\1                                      █▓▓▓██▒▒▒▒▒▒▓███████▓▓▓█                                      �\1                                         █▓▓▓███▒▒█████▓▓▓██                                        �\1                                            █▓▓▓▓▓█▓▓▓▓█                                            s                                                ██▓██                                               i                                                                                                    �\1                 ███████╗ ██████╗ ██╗  ██╗██╗  ██╗ ██████╗ ██╗   ██╗███╗   ██╗██████╗               �\1                 ██╔════╝██╔═══██╗╚██╗██╔╝██║  ██║██╔═══██╗██║   ██║████╗  ██║██╔══██╗              �\1                 █████╗  ██║   ██║ ╚███╔╝ ███████║██║   ██║██║   ██║██╔██╗ ██║██║  ██║              �\1                 ██╔══╝  ██║   ██║ ██╔██╗ ██╔══██║██║   ██║██║   ██║██║╚██╗██║██║  ██║              �\1                 ██║     ╚██████╔╝██╔╝ ██╗██║  ██║╚██████╔╝╚██████╔╝██║ ╚████║██████╔╝              �\1                 ╚═╝      ╚═════╝ ╚═╝  ╚═╝╚═╝  ╚═╝ ╚═════╝  ╚═════╝ ╚═╝  ╚═══╝╚═════╝               \nsetup\20kanagawa.colors\22nvim-web-devicons\27alpha.themes.dashboard\nalpha\frequire\v����\4\0" },
    loaded = true,
    path = "/home/devin/.local/share/nvim/site/pack/packer/start/alpha-nvim",
    url = "https://github.com/goolord/alpha-nvim"
  },
  ["cmp-buffer"] = {
    loaded = true,
    path = "/home/devin/.local/share/nvim/site/pack/packer/start/cmp-buffer",
    url = "https://github.com/hrsh7th/cmp-buffer"
  },
  ["cmp-nvim-lsp"] = {
    loaded = true,
    path = "/home/devin/.local/share/nvim/site/pack/packer/start/cmp-nvim-lsp",
    url = "https://github.com/hrsh7th/cmp-nvim-lsp"
  },
  ["cmp-nvim-lua"] = {
    loaded = true,
    path = "/home/devin/.local/share/nvim/site/pack/packer/start/cmp-nvim-lua",
    url = "https://github.com/hrsh7th/cmp-nvim-lua"
  },
  ["cmp-path"] = {
    loaded = true,
    path = "/home/devin/.local/share/nvim/site/pack/packer/start/cmp-path",
    url = "https://github.com/hrsh7th/cmp-path"
  },
  cmp_luasnip = {
    loaded = true,
    path = "/home/devin/.local/share/nvim/site/pack/packer/start/cmp_luasnip",
    url = "https://github.com/saadparwaiz1/cmp_luasnip"
  },
  ["friendly-snippets"] = {
    loaded = true,
    path = "/home/devin/.local/share/nvim/site/pack/packer/start/friendly-snippets",
    url = "https://github.com/rafamadriz/friendly-snippets"
  },
  harpoon = {
    loaded = true,
    path = "/home/devin/.local/share/nvim/site/pack/packer/start/harpoon",
    url = "https://github.com/theprimeagen/harpoon"
  },
  kanagawa = {
    config = { "\27LJ\2\n8\0\0\3\0\3\0\0056\0\0\0009\0\1\0'\2\2\0B\0\2\1K\0\1\0\25colorscheme kanagawa\bcmd\bvim\0" },
    loaded = true,
    path = "/home/devin/.local/share/nvim/site/pack/packer/start/kanagawa",
    url = "https://github.com/rebelot/kanagawa.nvim"
  },
  ["lsp-zero.nvim"] = {
    loaded = true,
    path = "/home/devin/.local/share/nvim/site/pack/packer/start/lsp-zero.nvim",
    url = "https://github.com/VonHeikemen/lsp-zero.nvim"
  },
  ["lsp_signature.nvim"] = {
    loaded = true,
    path = "/home/devin/.local/share/nvim/site/pack/packer/start/lsp_signature.nvim",
    url = "https://github.com/ray-x/lsp_signature.nvim"
  },
  ["lualine.nvim"] = {
    loaded = true,
    path = "/home/devin/.local/share/nvim/site/pack/packer/start/lualine.nvim",
    url = "https://github.com/nvim-lualine/lualine.nvim"
  },
  ["mason-lspconfig.nvim"] = {
    loaded = true,
    path = "/home/devin/.local/share/nvim/site/pack/packer/start/mason-lspconfig.nvim",
    url = "https://github.com/williamboman/mason-lspconfig.nvim"
  },
  ["mason.nvim"] = {
    loaded = true,
    path = "/home/devin/.local/share/nvim/site/pack/packer/start/mason.nvim",
    url = "https://github.com/williamboman/mason.nvim"
  },
  ["nvim-autopairs"] = {
    config = { "\27LJ\2\n@\0\0\3\0\3\0\a6\0\0\0'\2\1\0B\0\2\0029\0\2\0004\2\0\0B\0\2\1K\0\1\0\nsetup\19nvim-autopairs\frequire\0" },
    loaded = false,
    needs_bufread = false,
    only_cond = false,
    path = "/home/devin/.local/share/nvim/site/pack/packer/opt/nvim-autopairs",
    url = "https://github.com/windwp/nvim-autopairs"
  },
  ["nvim-cmp"] = {
    loaded = true,
    path = "/home/devin/.local/share/nvim/site/pack/packer/start/nvim-cmp",
    url = "https://github.com/hrsh7th/nvim-cmp"
  },
  ["nvim-lspconfig"] = {
    loaded = true,
    path = "/home/devin/.local/share/nvim/site/pack/packer/start/nvim-lspconfig",
    url = "https://github.com/neovim/nvim-lspconfig"
  },
  ["nvim-tree.lua"] = {
    config = { "\27LJ\2\n;\0\0\3\0\3\0\a6\0\0\0'\2\1\0B\0\2\0029\0\2\0004\2\0\0B\0\2\1K\0\1\0\nsetup\14nvim-tree\frequire\0" },
    loaded = true,
    path = "/home/devin/.local/share/nvim/site/pack/packer/start/nvim-tree.lua",
    url = "https://github.com/nvim-tree/nvim-tree.lua"
  },
  ["nvim-treesitter"] = {
    loaded = true,
    path = "/home/devin/.local/share/nvim/site/pack/packer/start/nvim-treesitter",
    url = "https://github.com/nvim-treesitter/nvim-treesitter"
  },
  ["nvim-web-devicons"] = {
    loaded = true,
    path = "/home/devin/.local/share/nvim/site/pack/packer/start/nvim-web-devicons",
    url = "https://github.com/nvim-tree/nvim-web-devicons"
  },
  ["packer.nvim"] = {
    loaded = true,
    path = "/home/devin/.local/share/nvim/site/pack/packer/start/packer.nvim",
    url = "https://github.com/wbthomason/packer.nvim"
  },
  ["plenary.nvim"] = {
    loaded = true,
    path = "/home/devin/.local/share/nvim/site/pack/packer/start/plenary.nvim",
    url = "https://github.com/nvim-lua/plenary.nvim"
  },
  ["telescope.nvim"] = {
    loaded = true,
    path = "/home/devin/.local/share/nvim/site/pack/packer/start/telescope.nvim",
    url = "https://github.com/nvim-telescope/telescope.nvim"
  },
  undotree = {
    loaded = true,
    path = "/home/devin/.local/share/nvim/site/pack/packer/start/undotree",
    url = "https://github.com/mbbill/undotree"
  },
  ["vim-fugitive"] = {
    loaded = true,
    path = "/home/devin/.local/share/nvim/site/pack/packer/start/vim-fugitive",
    url = "https://github.com/tpope/vim-fugitive"
  }
}

time([[Defining packer_plugins]], false)
-- Config for: nvim-tree.lua
time([[Config for nvim-tree.lua]], true)
try_loadstring("\27LJ\2\n;\0\0\3\0\3\0\a6\0\0\0'\2\1\0B\0\2\0029\0\2\0004\2\0\0B\0\2\1K\0\1\0\nsetup\14nvim-tree\frequire\0", "config", "nvim-tree.lua")
time([[Config for nvim-tree.lua]], false)
-- Config for: kanagawa
time([[Config for kanagawa]], true)
try_loadstring("\27LJ\2\n8\0\0\3\0\3\0\0056\0\0\0009\0\1\0'\2\2\0B\0\2\1K\0\1\0\25colorscheme kanagawa\bcmd\bvim\0", "config", "kanagawa")
time([[Config for kanagawa]], false)
-- Config for: alpha-nvim
time([[Config for alpha-nvim]], true)
try_loadstring("\27LJ\2\n�_\0\0\r\0)\1R6\0\0\0'\2\1\0B\0\2\0026\1\0\0'\3\2\0B\1\2\0026\2\0\0'\4\3\0B\2\2\0026\3\0\0'\5\4\0B\3\2\0029\3\5\3B\3\1\0025\4\6\0009\5\a\0019\5\b\5=\4\t\0059\5\a\0019\5\b\0059\5\n\5'\6\f\0=\6\v\0056\5\r\0009\5\14\0059\5\15\5)\a\0\0'\b\f\0005\t\17\0009\n\16\3=\n\18\tB\5\4\0015\5\19\0009\6\a\0019\6\20\0064\a\6\0009\b\21\1'\n\22\0009\v\23\5'\f\24\0&\v\f\v'\f\25\0B\b\4\2>\b\1\a9\b\21\1'\n\26\0009\v\27\5'\f\28\0&\v\f\vB\b\3\2>\b\2\a9\b\21\1'\n\29\0009\v\30\5'\f\31\0&\v\f\vB\b\3\2>\b\3\a9\b\21\1'\n \0009\v!\5'\f\"\0&\v\f\vB\b\3\2>\b\4\a9\b\21\1'\n#\0009\v$\5'\f%\0&\v\f\v'\f&\0B\b\4\0?\b\0\0=\a\t\0069\6\5\0009\b\n\1B\6\2\0016\6\r\0009\6'\6'\b(\0B\6\2\1K\0\1\0003 autocmd FileType alpha setlocal nofoldenable \bcmd\f:qa<CR>\f [Quit]\texit\6q\17 [Bookmarks]\rbookmark\n<C-e>\17 [Find File]\15filesearch\15<leader>pf\17 [File Tree]\tfile\14<leader>t\14:enew<CR>\16 [New File]\bnew\6e\vbutton\fbuttons\1\0\5\rbookmark\b\bnew\b\15filesearch\b\tfile\b\texit\t󰅗\afg\1\0\1\tbold\2\14waveAqua1\16nvim_set_hl\bapi\bvim\20DashboardHeader\ahi\topts\bval\vheader\fsection\0018\0\0�\1                                     ██████▓▓▓▓▓▓▓▓▓▓▓▓▓▓██████                                     �\1                          ███▓▓▓▓▓▓▓▓▓▓▓▓██████████████████▓▓▓▓▓▓▓▓▓▓▓▓███                          �\1                   ██▓▓▓▓▓▓▓▓████████████▒███▒▒██▒██▒▒▒▒█▒▒████████████▓▓▓▓▓▓▓██                    �\1                 █▓▓▓▓██████▒▒▒█▒▒▒▒▒█▒▒▒▓███▒▒██▒█▒███▒▒▒▓██▒█▒▒██▒█▒▒███████▓▓▓▓█                 �\1                 █▓▓███████▒███▓▒███▒▒█▒▒████▒▒██▒█▒███▒▒▒▓██▒█▒█▒█▒█▒███▒███████▓█                 �\1                 █▓▓███████▒▒███▒███▒█▒▒█▒███▒▒██▒█▒▒▒▒▒█▒▒██▒█▒██▒▒█▒███▒▒██████▓█                 �\1                 █▓▓███████▒█████▒▒▒███████████████████████████████▒█▒▒██▒██▒▒█▒█▓█                 �\1                 █▓▓███████████████▓▒▒▒▒▒████████████████████████████████████▒█▒█▓█                 �\1                 █▓▓███████▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒████████████████████████████████▒▒▒▒█▓█                 �\1                 █▓▓█▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒██▒█▒▒▒▒███████████████████████████▒██▒█▓█                 �\1                 █▓▓█▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒██████████████████▓████▓██▒█▓█                 �\1                 █▓▓█▒▒██▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒██████████▒▒▒▒▒████▓██████▓█                 �\1                 █▓▓█▒▒████████▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒█████▒▒▒▒▒██████████▒▒██▓█                 �\1                 █▓▓█▒▒▒███████████▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒██▒▒▒█████████████████▓█                 �\1                 █▓▓█▒▒▓  ███████████▒▒▒▒▒▒▒▒▒▒▒██▒▒███▒▒▒█▒▒▒███████████████████▓█                 �\1                 █▓▓█▒▒▒█    █████████▒▒▒▒▒▒█▒▒▒▒▒▒▒▒▒▒▒▓█▒▒░███████████ ████▒█▒█▓█                 �\1                 █▓▓█▒▒▒▒█   ░██████████▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒███████████  ██████▒█▓█                 �\1                 █▓▓█▒▒▒▒▓    █ █░ ███ █▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒░██████ █     ███▒▒▒▒▓▓█                 �\1                 █▓▓█▒▒▒▒▒▒█    █   ░█▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒█████     ██████▒█▓▓█                 �\1                 █▓▓█▒▒▒▒▒▒▒█░░   █▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒█▒ ░   ████████▒▓▓█                 �\1                 █▓▓█▒▒▒▒▒▒▒▒█░▓██▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒███████▒█▒▓▓█                 �\1                 █▓▓█▒▒▒▒▒▒▒▒▒██▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒██████████▓▓                  �\1                 █▓▓█▒▒▒▒▒▒▒▒▒▓█▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒█▒▒▒▒▒▒▒▒▒▒▒▒█▒▒▒████▒███▒▓▓                  �\1                 █▓▓█▒▒▒▒█▒▒▒▒█   █▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒█████▒▓███▓▓                  �\1                 █▓▓█▒▒▒▒▒▒▒▒▒▒█   ▒▒▒▒▒▒▒▒▒▒█▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▓▒▒▒▒█ ███▒▒▒▒█▓▓                  �\1                 █▓▓█▒▒▒▒▒▒▒▒▒▒█   ▓▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒█▒▒▒▒▒▒▒▒█▒▒▒▒▒█  ▓███▒███▓▓▓                  �\1                  ▓▓█ █▒▒▒▒█▒▒░█   ▒█████████▒▒██▒▒▒█▒▒▒▒▒█████▒▒▒▒▒   █████▒▒▒█▓▓                  �\1                  ▓▓█  ░██▒█▒▒▒ ██▒▒▒████   ████▒▒▒▒▒▒███ █ ███▒▒▒▒▒▓ ░█████▒▒▒█▓▓                  �\1                  ▓▓█      █▒▒▒  ░█▒▒▒▒██████████▒▒▒▒████████▒▒▒████  ███████▒██▓▓                  �\1                  ▓▓▓█  ░████▒▒▒█  ██▒▒▒▒▒▒▒▒█▒█▒▒▒▒▒█▓▒▒▒▒▒▒▒▒▒▒▒█  ███████████▓█                  �\1                  █▓▓██░██████▒▒▒▒░░ ██▒▒▒▒▒▒▒▒█▒▒▒▒▒█▒▒▒▒▒▒▒▒█    ████████████▓▓                   �\1                   █▓▓████████▒▒▒▒█░     ▓▒▒▒▒▒▒▒▒▒▒▒█▒▒▒▒█   ░     ██████████▓▓█                   �\1                    ▓▓▓████████▒▒▒▒▒▒▒█    ▒▒▒▒▒▒▒▒▒▒▒▒▒░     ▒█ ████████████▓▓█                    �\1                    █▓▓▓██████████▒▒▒▒▒▒▒████▒▒▒▒▒▒▒▒▒█   ░█████████████████▓▓█                     �\1████████████▓▓▓▓▓▓▓▓▓▓▓▓▓███████████▒▒▒▒▒▒▓▓  ▒▒▒▒▒▒▒▒   ██████████████████▓▓█                      �\1█▓██████████████████████████████████████▓▓▓▓   █▒▒▒▒▒    █████████████████▓▓█                       �\1 █▓▓█░   █░                             ▓▓▓▓   █▒▒▒▒▒█   ▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓█▓█                        �\1   ▓▓▓██▒  ░          ░    ░ ░          ▓▓▓▓  ▒███████░  ▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓█▓█                        �\1     █▓▓▓▓██████████████████████████████▓▓▓▓▓  ███████  ██████████████████▓█                        �\1         ███▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓████████▒▒▒▓▓░█░   █    ██████████████▓▓▓▓▓█                         �\1                              ▓▓▓███████▒▒▓▓▒▒▒▒▒▓█████████████████▓▓█                              �\1                               █▓▓▓███████▒▒▒▒▒▒▒▒███████████████▓▓▓                                �\1                                 █▓▓▓█████▓▒▒▒▒▒▒▒▒████████████▓▓▓█                                 �\1                                   █▓▓▓███▓▒▒▒▒▒▒▒▒██████████▓▓▓█                                   �\1                                      █▓▓▓██▒▒▒▒▒▒▓███████▓▓▓█                                      �\1                                         █▓▓▓███▒▒█████▓▓▓██                                        �\1                                            █▓▓▓▓▓█▓▓▓▓█                                            s                                                ██▓██                                               i                                                                                                    �\1                 ███████╗ ██████╗ ██╗  ██╗██╗  ██╗ ██████╗ ██╗   ██╗███╗   ██╗██████╗               �\1                 ██╔════╝██╔═══██╗╚██╗██╔╝██║  ██║██╔═══██╗██║   ██║████╗  ██║██╔══██╗              �\1                 █████╗  ██║   ██║ ╚███╔╝ ███████║██║   ██║██║   ██║██╔██╗ ██║██║  ██║              �\1                 ██╔══╝  ██║   ██║ ██╔██╗ ██╔══██║██║   ██║██║   ██║██║╚██╗██║██║  ██║              �\1                 ██║     ╚██████╔╝██╔╝ ██╗██║  ██║╚██████╔╝╚██████╔╝██║ ╚████║██████╔╝              �\1                 ╚═╝      ╚═════╝ ╚═╝  ╚═╝╚═╝  ╚═╝ ╚═════╝  ╚═════╝ ╚═╝  ╚═══╝╚═════╝               \nsetup\20kanagawa.colors\22nvim-web-devicons\27alpha.themes.dashboard\nalpha\frequire\v����\4\0", "config", "alpha-nvim")
time([[Config for alpha-nvim]], false)
vim.cmd [[augroup packer_load_aucmds]]
vim.cmd [[au!]]
  -- Event lazy-loads
time([[Defining lazy-load event autocommands]], true)
vim.cmd [[au InsertEnter * ++once lua require("packer.load")({'nvim-autopairs'}, { event = "InsertEnter *" }, _G.packer_plugins)]]
time([[Defining lazy-load event autocommands]], false)
vim.cmd("augroup END")

_G._packer.inside_compile = false
if _G._packer.needs_bufread == true then
  vim.cmd("doautocmd BufRead")
end
_G._packer.needs_bufread = false

if should_profile then save_profiles() end

end)

if not no_errors then
  error_msg = error_msg:gsub('"', '\\"')
  vim.api.nvim_command('echohl ErrorMsg | echom "Error in packer_compiled: '..error_msg..'" | echom "Please check your config for correctness" | echohl None')
end
